ambiot/amazon-freertos/lib/ota/portable/realtek/ameba/aws_ota_rtl8710b.c
/*
Amazon FreeRTOS OTA PAL for Realtek Ameba V1.0.0
Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.

Permission is hereby granted, free of charge, to any person obtaining a copy of
this software and associated documentation files (the "Software"), to deal in
the Software without restriction, including without limitation the rights to
use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
the Software, and to permit persons to whom the Software is furnished to do so,
subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

 http://aws.amazon.com/freertos
 http://www.FreeRTOS.org
*/

/* OTA PAL implementation for Realtek Ameba platform. */
#include "aws_ota_pal.h"
#include "aws_ota_agent.h"
#include "aws_crypto.h"
#include "aws_ota_codesigner_certificate.h"
#include "Aws_ota_agent_internal.h"
#include "platform_opts.h"
#if CONFIG_EXAMPLE_AMAZON_AFQP_TESTS
#include "aws_test_runner_config.h"
#endif
#include "flash_api.h"
#include <device_lock.h>
#include "rtl8710b_ota.h"
#include "platform_stdlib.h"

extern void PRCMHibernateCycleTrigger(void);
extern uint32_t http_ota_target_index;
extern const update_file_img_id OtaImgId[2];
extern uint32_t update_ota_prepare_addr(void);

#define OTA_DEBUG 0
#define OTA_MEMDUMP 0
#define OTA_PRINT DiagPrintf

static uint32_t aws_ota_imgaddr = 0;
static uint32_t aws_ota_imgsz = 0;
static bool_t aws_ota_target_hdr_get = false;
static update_ota_target_hdr aws_ota_target_hdr;
static uint8_t aws_ota_signature[9] = {0};
#define AWS_OTA_IMAGE_STATE_FLASH_OFFSET                  ( 0xFC000 )
#define AWS_OTA_IMAGE_STATE_FLAG_IMG_NEW                  0xffffffffU /* 11111111b A new image that hasn't yet been run. */
#define AWS_OTA_IMAGE_STATE_FLAG_PENDING_COMMIT              0xfffffffeU /* 11111110b Image is pending commit and is ready for self test. */
#define AWS_OTA_IMAGE_STATE_FLAG_IMG_VALID               0xfffffffcU /* 11111100b The image was accepted as valid by the self test code. */
#define AWS_OTA_IMAGE_STATE_FLAG_IMG_INVALID           0xfffffff8U /* 11111000b The image was NOT accepted by the self test code. */

#if 1//OTA_DEBUG && OTA_MEMDUMP
static void vMemDump(const u8 *start, u32 size, char * strHeader)
{
    int row, column, index, index2, max;
    u8 *buf, *line;

    if(!start ||(size==0))
            return;

    line = (u8*)start;

    /*
    16 bytes per line
    */
    if (strHeader)
       DiagPrintf ("%s", strHeader);

    column = size % 16;
    row = (size / 16) + 1;
    for (index = 0; index < row; index++, line += 16) 
    {
        buf = (u8*)line;

        max = (index == row - 1) ? column : 16;
        if ( max==0 ) break; /* If we need not dump this line, break it. */

        DiagPrintf ("\n[%08x] ", line);
        
        //Hex
        for (index2 = 0; index2 < max; index2++)
        {
            if (index2 == 8)
            DiagPrintf ("  ");
            DiagPrintf ("%02x ", (u8) buf[index2]);
        }

        if (max != 16)
        {
            if (max < 8)
                DiagPrintf ("  ");
            for (index2 = 16 - max; index2 > 0; index2--)
                DiagPrintf ("   ");
        }

    }

    DiagPrintf ("\n");
    return;
}
#endif

static void prvSysReset_rtl8710b(void)
{
    CPU_ClkSet(CLK_31_25M);
    vTaskDelay(100);
    /* CPU reset: Cortex-M3 SCB->AIRCR*/
    NVIC_SystemReset();	
}

static __inline__ bool_t prvContextValidate_rtl8710b( OTA_FileContext_t *C )
{
    return pdTRUE;
}

OTA_Err_t prvPAL_Abort_rtl8710b(OTA_FileContext_t *C)
{
    if( NULL != C)
    {
        C->lFileHandle = 0x0;        
    }
    return kOTA_Err_None;
}

bool_t prvPAL_CreateFileForRx_rtl8710b(OTA_FileContext_t *C)
{
    uint32_t data;
	int i = 0;
	flash_t flash;
    C->lFileHandle = update_ota_prepare_addr();
    if (C->lFileHandle > SPI_FLASH_BASE)
    {
        aws_ota_imgaddr = 0;
        aws_ota_imgsz = 0;
        aws_ota_target_hdr_get = false;
        memset((void *)&aws_ota_target_hdr, 0, sizeof(update_ota_target_hdr));
        memset((void *)aws_ota_signature, 0, sizeof(aws_ota_signature));
        aws_ota_imgaddr = C->lFileHandle;
        data = HAL_READ32(SPI_FLASH_BASE, OFFSET_DATA);
        OTA_PRINT("[OTA] addr: 0x%08x, data 0x%08x\r\n", aws_ota_imgaddr, data);
	device_mutex_lock(RT_DEV_LOCK_FLASH);
            for( i = 0; i < (((OTA2_ADDR-OTA1_ADDR-1)/4096)+1); i++){
                flash_erase_sector(&flash, aws_ota_imgaddr - SPI_FLASH_BASE + i * 4096);
	    }
	device_mutex_unlock(RT_DEV_LOCK_FLASH);
    }
    else {
        OTA_PRINT("[OTA] invalid ota addr (%d) \r\n", C->lFileHandle);
        C->lFileHandle = NULL;      /* Nullify the file handle in all error cases. */
    }
    return ( C->lFileHandle > SPI_FLASH_BASE ) ? pdTRUE : pdFALSE;
}

/* Read the specified signer certificate from the filesystem into a local buffer. The
 * allocated memory becomes the property of the caller who is responsible for freeing it.
 */
uint8_t * prvPAL_ReadAndAssumeCertificate(const uint8_t * const pucCertName, int32_t * const lSignerCertSize)
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_ReadAndAssumeCertificate" );

    uint8_t*    pucCertData;
    uint32_t    ulCertSize;
    uint8_t		*pucSignerCert = NULL;
    
    extern BaseType_t PKCS11_PAL_GetObjectValue( const char * pcFileName,
                               uint8_t ** ppucData,
                               uint32_t * pulDataSize );

    if ( PKCS11_PAL_GetObjectValue( (const char *) pucCertName, &pucCertData, &ulCertSize ) != pdTRUE )
    {   /* Use the back up "codesign_keys.h" file if the signing credentials haven't been saved in the device. */
        pucCertData = (uint8_t*) signingcredentialSIGNING_CERTIFICATE_PEM;
        ulCertSize = sizeof( signingcredentialSIGNING_CERTIFICATE_PEM );
        OTA_LOG_L1( "[%s] Assume Cert - No such file: %s. Using header file\r\n", OTA_METHOD_NAME,
                   (const char*)pucCertName );
    }
    else
    {
        OTA_LOG_L1( "[%s] Assume Cert - file: %s OK\r\n", OTA_METHOD_NAME, (const char*)pucCertName );
    }

    /* Allocate memory for the signer certificate plus a terminating zero so we can load it and return to the caller. */
    pucSignerCert = pvPortMalloc( ulCertSize +  1);
    if ( pucSignerCert != NULL )
    {
        memcpy( pucSignerCert, pucCertData, ulCertSize );
        /* The crypto code requires the terminating zero to be part of the length so add 1 to the size. */
        pucSignerCert[ ulCertSize ] = '\0';
        *lSignerCertSize = ulCertSize + 1;
    }
    return (uint8_t *)pucSignerCert;
}

static OTA_Err_t prvSignatureVerificationUpdate_rtl8710b(OTA_FileContext_t *C, void * pvContext)
{
    u32 i;
    flash_t flash;
    u32 flash_checksum=0;
    u32 rdp_checksum=0;
    u32 NewImg2BlkSize;
    u8 * pTempbuf;
    int k;
    int rlen;
    u32 len = aws_ota_imgsz;
    u32 addr = aws_ota_target_hdr.FileImgHdr.FlashOffset;
    OTA_Err_t eResult = kOTA_Err_None;
    if(len <= 0) {
      eResult = kOTA_Err_SignatureCheckFailed;
      return eResult;
    }
    NewImg2BlkSize = ((len - 1)/4096) + 1;

