ambiot/amazon-freertos/lib/ota/portable/realtek/ameba/aws_ota_rtl8710b.c
    /*the upgrade space should be masked, because the encrypt firmware is used 
    for checksum calculation*/
    OTF_Mask(1, (addr - SPI_FLASH_BASE), NewImg2BlkSize, 1);

    pTempbuf = ota_update_malloc(BUF_SIZE);
    if(!pTempbuf){
        eResult = kOTA_Err_SignatureCheckFailed;
        goto error;
    }
    /*add image signature*/
   CRYPTO_SignatureVerificationUpdate(pvContext, aws_ota_signature, 8);

    len = len-8;
    /* read flash data back to check signature of the image */
    for(i=0;i<len;i+=BUF_SIZE){
    	rlen = (len-i)>BUF_SIZE?BUF_SIZE:(len-i);
    	flash_stream_read(&flash, addr - SPI_FLASH_BASE+i+8, rlen, pTempbuf);
    	Cache_Flush();
       CRYPTO_SignatureVerificationUpdate(pvContext, pTempbuf, rlen);
    }

    /*mask the rdp flash space to read the rdp image and calculate the checksum*/
    if(aws_ota_target_hdr.RdpStatus == ENABLE) {
#if 0
        for(i = 0; i < aws_ota_target_hdr.FileRdpHdr.ImgLen; i++) {
            flash_stream_read(&flash, RDP_FLASH_ADDR - SPI_FLASH_BASE+i, 1, pTempbuf);
            Cache_Flush();
            CRYPTO_SignatureVerificationUpdate(pvContext, pTempbuf, 1);
        }
#else
        OTA_PRINT("OTA RDP not implemented yet\r\n");
        configASSERT(0);
        eResult = kOTA_Err_SignatureCheckFailed;
        goto error;
#endif
    }

    OTF_Mask(1, (addr - SPI_FLASH_BASE), NewImg2BlkSize, 0);

error:
    if(pTempbuf)
        ota_update_free(pTempbuf);
    return eResult;	
}

extern void *calloc_freertos(size_t nelements, size_t elementSize);
OTA_Err_t prvPAL_SetPlatformImageState_rtl8710b (OTA_ImageState_t eState);
OTA_Err_t prvPAL_CheckFileSignature(OTA_FileContext_t * const C)
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CheckFileSignature_rtl8710b" );

    OTA_Err_t eResult;
    int32_t lSignerCertSize;
    void *pvSigVerifyContext;
    uint8_t *pucSignerCert = NULL;
    mbedtls_platform_set_calloc_free(calloc_freertos, vPortFree);

    while(true)
    {
        /* Verify an ECDSA-SHA256 signature. */
        if (CRYPTO_SignatureVerificationStart( &pvSigVerifyContext, cryptoASYMMETRIC_ALGORITHM_ECDSA,
                                              cryptoHASH_ALGORITHM_SHA256) == pdFALSE)
        {
            eResult = kOTA_Err_SignatureCheckFailed;
            break;
        }

        OTA_LOG_L1( "[%s] Started %s signature verification, file: %s\r\n", OTA_METHOD_NAME, 
                   cOTA_JSON_FileSignatureKey, (const char*)C->pucCertFilepath);
        pucSignerCert = prvPAL_ReadAndAssumeCertificate((const uint8_t* const)C->pucCertFilepath, &lSignerCertSize);
        if (pucSignerCert == NULL)
        {
            eResult = kOTA_Err_BadSignerCert;
            break;
        }

        eResult = prvSignatureVerificationUpdate_rtl8710b(C, pvSigVerifyContext);
        if(eResult != kOTA_Err_None)
            break;

        if ( CRYPTO_SignatureVerificationFinal(pvSigVerifyContext, (char*)pucSignerCert, lSignerCertSize,
                                                    C->pxSignature->ucData, C->pxSignature->usSize ) == pdFALSE )
        {
            eResult = kOTA_Err_SignatureCheckFailed;
            prvPAL_SetPlatformImageState_rtl8710b(eOTA_ImageState_Rejected);
        }
        else
        {
            eResult = kOTA_Err_None;
        }
        break;
    }
    /* Free the signer certificate that we now own after prvPAL_ReadAndAssumeCertificate(). */
    if( pucSignerCert != NULL )
    {
        vPortFree(pucSignerCert);
    }
    return eResult;
}

/* Close the specified file. This will also authenticate the file if it is marked as secure. */
OTA_Err_t prvPAL_CloseFile_rtl8710b(OTA_FileContext_t *C)
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CloseFile" );
    OTA_Err_t eResult = kOTA_Err_None;

    OTA_PRINT("[OTA] Authenticating and closing file.\r\n");

    if( prvContextValidate_rtl8710b( C ) == pdFALSE )
    {
        eResult = kOTA_Err_FileClose;
    }

    if( kOTA_Err_None == eResult )
    {
        if( C->pxSignature != NULL )
        {
            OTA_LOG_L1( "[%s] Authenticating and closing file.\r\n", OTA_METHOD_NAME );
            vMemDump(C->pxSignature->ucData, C->pxSignature->usSize, "Signature");
            /* TODO: Verify the file signature, close the file and return the signature verification result. */
            eResult = prvPAL_CheckFileSignature( C );
            //eResult = kOTA_Err_None;
        }
        else
        {
            eResult = kOTA_Err_SignatureCheckFailed;
        }
    }
#if testrunnerFULL_OTA_PAL_ENABLED
	aws_ota_imgaddr = 0;
    aws_ota_imgsz = 0;
    aws_ota_target_hdr_get = false;
    memset((void *)&aws_ota_target_hdr, 0, sizeof(update_ota_target_hdr));
    memset((void *)aws_ota_signature, 0, sizeof(aws_ota_signature));
#endif
    return eResult;
}

int16_t prvPAL_WriteBlock_rtl8710b(OTA_FileContext_t *C, int32_t iOffset, uint8_t* pacData, uint32_t iBlockSize)
{
    flash_t flash;
    uint32_t address = C->lFileHandle - SPI_FLASH_BASE;
    uint32_t NewImg2Len = 0;
    uint32_t NewImg2BlkSize = 0;
    static bool_t wait_target_img = true;
    static uint32_t img_sign = 0;
    uint32_t WriteLen, offset;
    
#if testrunnerFULL_OTA_PAL_ENABLED
    OTA_PRINT("[OTA_TEST] Write %d bytes @ 0x%x\n", iBlockSize, address+iOffset);
    device_mutex_lock(RT_DEV_LOCK_FLASH);
    if(flash_stream_write(&flash, address+iOffset, iBlockSize, pacData) < 0){
        OTA_PRINT("[%s] Write sector failed\n", __FUNCTION__);
        device_mutex_unlock(RT_DEV_LOCK_FLASH);
        return -1;
    }
    aws_ota_imgsz += iBlockSize;
    device_mutex_unlock(RT_DEV_LOCK_FLASH);
	memset((void *)aws_ota_signature, 0, sizeof(aws_ota_signature));
	memcpy((void *)aws_ota_signature, pacData, sizeof(aws_ota_signature));
	aws_ota_target_hdr.FileImgHdr.FlashOffset = C->lFileHandle;
    return iBlockSize;
#endif

    if (aws_ota_target_hdr_get != true) {
        u8 ImgId[5] = {0};
        u32 RevHdrLen;
        int i;
        if(iOffset != 0){
            OTA_PRINT("OTA header not found yet\r\n");
            //configASSERT(0);
            return -1;
        }
        wait_target_img = true;
        img_sign = 0;
        aws_ota_imgaddr = 0;
        aws_ota_imgsz = 0;
        memset((void *)&aws_ota_target_hdr, 0, sizeof(update_ota_target_hdr));
        memset((void *)aws_ota_signature, 0, sizeof(aws_ota_signature));
        memcpy(ImgId, (u8 *)(&OtaImgId[http_ota_target_index]), 4);
        memcpy((u8*)(&aws_ota_target_hdr.FileHdr), pacData, sizeof(aws_ota_target_hdr.FileHdr));
        if(aws_ota_target_hdr.FileHdr.HdrNum > 2 || aws_ota_target_hdr.FileHdr.HdrNum <= 0) {
            OTA_PRINT("INVALID IMAGE BLOCK 0\r\n");
            vMemDump(pacData, iBlockSize, NULL);
            vTaskDelay(500);
            configASSERT(0);
            return -1;
        }
        memcpy((u8*)(&aws_ota_target_hdr.FileImgHdr), pacData+sizeof(aws_ota_target_hdr.FileHdr), 8);
        RevHdrLen = (aws_ota_target_hdr.FileHdr.HdrNum * aws_ota_target_hdr.FileImgHdr.ImgHdrLen) + sizeof(aws_ota_target_hdr.FileHdr);
        OTA_PRINT("TempBuf = %s\n", ImgId);
        if (!get_ota_tartget_header(pacData, RevHdrLen, &aws_ota_target_hdr, ImgId)) {
            OTA_PRINT("Get OTA header failed\n");
            return -1;
        }
        /*get new image length from the firmware header*/
        NewImg2Len = aws_ota_target_hdr.FileImgHdr.ImgLen;
        OTA_PRINT("New image length = %d\n", NewImg2Len);
        NewImg2BlkSize = ((NewImg2Len - 1)/4096) + 1;
        /* if OTA1 will be update, image size should not cross OTA2 */
        if(http_ota_target_index== OTA_INDEX_1) {
            if(aws_ota_target_hdr.FileImgHdr.ImgLen > (OTA2_ADDR - OTA1_ADDR)) {
                OTA_PRINT("[OTA][%s] illegal new image length 0x%x\r\n", __FUNCTION__, aws_ota_target_hdr.FileImgHdr.ImgLen);
                return -1;
            }
        }
        OTA_PRINT("[OTA][%s] NewImg2BlkSize %d\n", __FUNCTION__, NewImg2BlkSize);
        device_mutex_lock(RT_DEV_LOCK_FLASH);
        for( i = 0; i < NewImg2BlkSize; i++){
            flash_erase_sector(&flash, C->lFileHandle -SPI_FLASH_BASE + i * 4096);
            OTA_PRINT("[OTA] Erase sector @ 0x%x\n", C->lFileHandle -SPI_FLASH_BASE + i * 4096);
        }
        device_mutex_unlock(RT_DEV_LOCK_FLASH);
        /*the upgrade space should be masked, because the encrypt firmware is used 
        for checksum calculation*/
        OTF_Mask(1, (C->lFileHandle -SPI_FLASH_BASE), NewImg2BlkSize, 1);
        aws_ota_target_hdr_get = true;
    }
    OTA_PRINT("[OTA][%s] iFileSize %d, iOffset: 0x%x: iBlockSize: 0x%x\n", __FUNCTION__, C->ulFileSize, iOffset, iBlockSize);
	if((C->ulFileSize/OTA_FILE_BLOCK_SIZE) == (iOffset/OTA_FILE_BLOCK_SIZE)){
		OTA_PRINT("[OTA] Final block with signature arrived\n");
		vMemDump(pacData, iBlockSize, "Full signature");
		uint32_t ota1_size = *(pacData+(iBlockSize-2));
		uint32_t ota2_size = *(pacData+(iBlockSize-1));
		if(http_ota_target_index == OTA_INDEX_1) {
			OTA_PRINT("[OTA][%s] OTA1 Sig Size is %d\n", __FUNCTION__, ota1_size);
			C->pxSignature->usSize = ota1_size;
			memcpy(C->pxSignature->ucData, pacData, ota1_size);
			vMemDump(C->pxSignature->ucData, C->pxSignature->usSize, "Signature Write");
			}
		else {
			OTA_PRINT("[OTA][%s] OTA2 Sig Size is %d\n", __FUNCTION__, ota2_size);
			C->pxSignature->usSize = ota2_size;
			memcpy(C->pxSignature->ucData, pacData+ota1_size, ota2_size);
			vMemDump(C->pxSignature->ucData, C->pxSignature->usSize, "Signature Write");
			}
		}
    if(((iOffset + iBlockSize) <= aws_ota_target_hdr.FileImgHdr.Offset) || (iOffset >= (aws_ota_target_hdr.FileImgHdr.Offset + aws_ota_target_hdr.FileImgHdr.ImgLen))) {
        OTA_PRINT("[OTA] It's not OTA%d, skipped\n", http_ota_target_index+1);
        return iBlockSize;
    }
    if(aws_ota_imgsz >= aws_ota_target_hdr.FileImgHdr.ImgLen){
        OTA_PRINT("[OTA] image download is already done, dropped\n");
        return iBlockSize;
    }
    if(wait_target_img == true && iOffset <= aws_ota_target_hdr.FileImgHdr.Offset) {
        uint32_t byte_to_write = (iOffset + iBlockSize) - aws_ota_target_hdr.FileImgHdr.Offset;
        pacData += (iBlockSize -byte_to_write);
        OTA_PRINT("[OTA] FIRST image data arrived %d\n", byte_to_write);
        if(img_sign < 8){
            img_sign = (byte_to_write > 8)?8:byte_to_write;
            memcpy(aws_ota_signature, pacData, img_sign);
            OTA_PRINT("[OTA] Signature get [%d]%s\n", img_sign, aws_ota_signature);
            byte_to_write -= img_sign;
            pacData += img_sign;
            aws_ota_imgsz += img_sign;
        }
        OTA_PRINT("[OTA] FIRST Write %d bytes @ 0x%x\n", byte_to_write, address);
        device_mutex_lock(RT_DEV_LOCK_FLASH);
        if(flash_stream_write(&flash, address+8, byte_to_write, pacData) < 0){
            OTA_PRINT("[%s] Write sector failed\n", __FUNCTION__);
            device_mutex_unlock(RT_DEV_LOCK_FLASH);
            return -1;
        }
#if OTA_DEBUG && OTA_MEMDUMP
        vMemDump(pacData, byte_to_write, "PAYLOAD");
#endif
        device_mutex_unlock(RT_DEV_LOCK_FLASH);
        aws_ota_imgsz += byte_to_write;
        if (img_sign >= 8)
            wait_target_img = false;
        return iBlockSize;
    }

    WriteLen = iBlockSize;
    offset = iOffset - aws_ota_target_hdr.FileImgHdr.Offset;
    if ((offset + iBlockSize) >= aws_ota_target_hdr.FileImgHdr.ImgLen) {
        WriteLen -= (offset + iBlockSize - aws_ota_target_hdr.FileImgHdr.ImgLen);
        OTA_PRINT("[OTA] LAST image data arrived %d\n", WriteLen);
    }
    OTA_PRINT("[OTA] Write %d bytes @ 0x%x\n", WriteLen, address + offset);
    device_mutex_lock(RT_DEV_LOCK_FLASH);
    if(flash_stream_write(&flash, address + offset, WriteLen, pacData) < 0){
        OTA_PRINT("[%s] Write sector failed\n", __FUNCTION__);
        device_mutex_unlock(RT_DEV_LOCK_FLASH);
        return -1;
    }
#if OTA_DEBUG && OTA_MEMDUMP
    vMemDump(pacData, iBlockSize, "PAYLOAD");
#endif
    device_mutex_unlock(RT_DEV_LOCK_FLASH);
    aws_ota_imgsz += WriteLen;
    return iBlockSize;
}

