ambiot/amazon-freertos/lib/ota/portable/realtek/ameba/aws_ota_rtl8710b.c
OTA_Err_t prvPAL_ActivateNewImage_rtl8710b(void)
{
    flash_t flash;
    /* Reset the MCU so we can test the new image. Short delay for debug log output. */
    OTA_PRINT("[OTA] [%s] Download new firmware %d bytes completed @ 0x%x\n", __FUNCTION__, aws_ota_imgsz, aws_ota_target_hdr.FileImgHdr.FlashOffset);
    OTA_PRINT("[OTA] signature: %s, size = %d, OtaTargetHdr.FileImgHdr.ImgLen = %d\n", aws_ota_signature, aws_ota_imgsz, aws_ota_target_hdr.FileImgHdr.ImgLen);
    /*------------- verify checksum and update signature-----------------*/
    if(verify_ota_checksum(aws_ota_target_hdr.FileImgHdr.FlashOffset, aws_ota_imgsz - 8, aws_ota_signature, &aws_ota_target_hdr)){
        if(!change_ota_signature(aws_ota_target_hdr.FileImgHdr.FlashOffset, aws_ota_signature, http_ota_target_index)) {
            OTA_PRINT("[OTA] [%s], change signature failed\r\n", __FUNCTION__);
            return kOTA_Err_ActivateFailed;
        } else {
            device_mutex_lock(RT_DEV_LOCK_FLASH);
            flash_erase_sector(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET);
            flash_write_word(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET, AWS_OTA_IMAGE_STATE_FLAG_PENDING_COMMIT);
            device_mutex_unlock(RT_DEV_LOCK_FLASH);
            OTA_PRINT("[OTA] [%s] Update OTA success!\r\n", __FUNCTION__);
        }
    }else{
        /*if checksum error, clear the signature zone which has been written in flash in case of boot from the wrong firmware*/
        device_mutex_lock(RT_DEV_LOCK_FLASH);
        flash_erase_sector(&flash, aws_ota_target_hdr.FileImgHdr.FlashOffset - SPI_FLASH_BASE);
        device_mutex_unlock(RT_DEV_LOCK_FLASH);
        OTA_PRINT("[OTA] [%s] The checksume is wrong!\n\r", __FUNCTION__);
        return kOTA_Err_ActivateFailed;
    }
    OTA_PRINT("[OTA] Resetting MCU to activate new image.\r\n");
    vTaskDelay( 500 );
    prvSysReset_rtl8710b();
    return kOTA_Err_None;
}

OTA_Err_t prvPAL_ResetDevice_rtl8710b ( void )
{
    prvSysReset_rtl8710b();
    return kOTA_Err_None;
}

OTA_Err_t prvPAL_SetPlatformImageState_rtl8710b (OTA_ImageState_t eState)
{
    DEFINE_OTA_METHOD_NAME( "prvSetImageState_rtl8710b" );
    OTA_Err_t eResult = kOTA_Err_Uninitialized;
    uint32_t ota_imagestate =  AWS_OTA_IMAGE_STATE_FLAG_IMG_INVALID;
    flash_t flash;
    device_mutex_lock(RT_DEV_LOCK_FLASH);
    flash_read_word(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET, &ota_imagestate);
    device_mutex_unlock(RT_DEV_LOCK_FLASH);
    //OTA_PRINT("[OTA] %s not implemented yet.\r\n", __func__);
    if ( eState == eOTA_ImageState_Accepted )
    {
        /* This should be an image launched in self test mode! */
        if ( ota_imagestate == AWS_OTA_IMAGE_STATE_FLAG_PENDING_COMMIT )
        {   
            /* Mark the image as valid */
            ota_imagestate = AWS_OTA_IMAGE_STATE_FLAG_IMG_VALID;

            device_mutex_lock(RT_DEV_LOCK_FLASH);
            flash_write_word(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET, ota_imagestate);
            device_mutex_unlock(RT_DEV_LOCK_FLASH);

            {
                OTA_LOG_L1( "[%s] Accepted and committed final image.\r\n", OTA_METHOD_NAME );
                
                /* Disable the watchdog timer. */
                //prvPAL_WatchdogDisable();
                
                eResult = kOTA_Err_None;
            }
#if 0
            else
            {
                OTA_LOG_L1( "[%s] Accepted final image but commit failed (%d).\r\n", OTA_METHOD_NAME,
                           MCHP_ERR_FLASH_WRITE_FAIL );
                eResult = ( uint32_t ) kOTA_Err_CommitFailed | ( ( ( uint32_t ) MCHP_ERR_FLASH_WRITE_FAIL ) & ( uint32_t ) kOTA_PAL_ErrMask );
            }
#endif
        }
        else
        {
            OTA_LOG_L1( "[%s] Warning: image is not pending commit (0x%02x)\r\n", OTA_METHOD_NAME, ota_imagestate );
            if ( ota_imagestate == AWS_OTA_IMAGE_STATE_FLAG_IMG_VALID )
            {
                eResult = kOTA_Err_None;
            }
            else
            {
                eResult = ( uint32_t ) kOTA_Err_CommitFailed/* | ( ( ( uint32_t ) MCHP_ERR_NOT_PENDING_COMMIT ) & ( uint32_t ) kOTA_PAL_ErrMask )*/;
            }
        }
    }
    else if ( eState == eOTA_ImageState_Rejected )
    {
	/* The image in the program image bank (upper bank) is rejected so mark it invalid.  */    
#if 0
        /* Copy the descriptor in program bank. */
        xDescCopy = *pxAppImgDescProgImageBank;
        
        /* Mark the image in program bank as invalid */
        xDescCopy.xImgHeader.ucImgFlags = AWS_BOOT_FLAG_IMG_INVALID;

        if ( AWS_NVM_QuadWordWrite( pxAppImgDescProgImageBank->xImgHeader.ulAlign, xDescCopy.xImgHeader.ulAlign,
                                    sizeof( xDescCopy ) / AWS_NVM_QUAD_SIZE ) == ( bool_t ) pdTRUE ) 
#endif
        {

#if testrunnerFULL_OTA_PAL_ENABLED
			ota_imagestate = AWS_OTA_IMAGE_STATE_FLAG_IMG_INVALID;
			device_mutex_lock(RT_DEV_LOCK_FLASH);
    		flash_write_word(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET, ota_imagestate);
    		device_mutex_unlock(RT_DEV_LOCK_FLASH);
            eResult = kOTA_Err_None;
#else
        	u32 ota_target_reset_index;
            OTA_LOG_L1( "[%s] Rejecting and invalidating image.\r\n", OTA_METHOD_NAME );
			if (ota_get_cur_index() == OTA_INDEX_1) {
				ota_target_reset_index = OTA_INDEX_2;
				}
			else {
				ota_target_reset_index = OTA_INDEX_1;
				}
			device_mutex_lock(RT_DEV_LOCK_FLASH);
			OTA_Change(ota_target_reset_index);
			device_mutex_unlock(RT_DEV_LOCK_FLASH);
			//Preventing self timer reset
			ota_imagestate = AWS_OTA_IMAGE_STATE_FLAG_IMG_NEW;
			device_mutex_lock(RT_DEV_LOCK_FLASH);
			flash_erase_sector(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET);
    		flash_write_word(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET, ota_imagestate);
    		device_mutex_unlock(RT_DEV_LOCK_FLASH);
            eResult = kOTA_Err_None;
#endif
        }
#if 0
        else {
            OTA_LOG_L1( "[%s] Reject failed to invalidate the final image (%d).\r\n", OTA_METHOD_NAME,
                        MCHP_ERR_FLASH_WRITE_FAIL );
            eResult = ( uint32_t ) kOTA_Err_RejectFailed | ( ( ( uint32_t ) MCHP_ERR_FLASH_WRITE_FAIL ) & ( uint32_t ) kOTA_PAL_ErrMask );
        }
#endif
    }
    else if ( eState == eOTA_ImageState_Aborted ) 
    {
	/* The OTA on program image bank (upper bank) is aborted so mark it as invalid.  */ 
#if 0
        /* Copy the descriptor in program bank. */
        xDescCopy = *pxAppImgDescProgImageBank;
        
        /* Mark the image in upper bank as invalid */
        xDescCopy.xImgHeader.ucImgFlags = AWS_BOOT_FLAG_IMG_INVALID;

        if ( AWS_NVM_QuadWordWrite( pxAppImgDescProgImageBank->xImgHeader.ulAlign, xDescCopy.xImgHeader.ulAlign,
                                    sizeof (xDescCopy ) / AWS_NVM_QUAD_SIZE ) == ( bool_t ) pdTRUE  ) 
#endif
        {
            OTA_LOG_L1( "[%s] Aborting and invalidating image.\r\n", OTA_METHOD_NAME );
            eResult = kOTA_Err_None;
        }
#if 0
        else {
            OTA_LOG_L1( "[%s] Abort failed to invalidate the final image (%d).\r\n", OTA_METHOD_NAME,
                        MCHP_ERR_FLASH_WRITE_FAIL );
            eResult = ( uint32_t ) kOTA_Err_AbortFailed | ( ( ( uint32_t ) MCHP_ERR_FLASH_WRITE_FAIL ) & ( uint32_t ) kOTA_PAL_ErrMask );
        }
#endif
    }
    else if ( eState == eOTA_ImageState_Testing )
    {
        OTA_LOG_L1( "[%s] Testing image.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_None;
    }
    else
    {
        OTA_LOG_L1( "[%s] Bad Image State.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_BadImageState;
    }
    
	return eResult;
}

OTA_PAL_ImageState_t prvPAL_GetPlatformImageState_rtl8710b( void )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_GetPlatformImageState_rtl8710b" );
    //OTA_PRINT("[OTA] %s not implemented yet.\r\n", __func__);
    //BootImageDescriptor_t xDescCopy;
    OTA_PAL_ImageState_t eImageState = eOTA_PAL_ImageState_Unknown;
    //const BootImageDescriptor_t* pxAppImgDesc;
    //pxAppImgDesc = ( const BootImageDescriptor_t* ) KVA0_TO_KVA1( pcFlashLowerBankStart ); /*lint !e923 !e9027 !e9029 !e9033 !e9079 !e9078 !e9087 Please see earlier lint comment header. */
    //xDescCopy = *pxAppImgDesc;
    uint32_t ota_imagestate =  AWS_OTA_IMAGE_STATE_FLAG_IMG_INVALID;
    flash_t flash;

    device_mutex_lock(RT_DEV_LOCK_FLASH);
    flash_read_word(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET, &ota_imagestate);
    device_mutex_unlock(RT_DEV_LOCK_FLASH);

    switch ( ota_imagestate )
    {
        case AWS_OTA_IMAGE_STATE_FLAG_PENDING_COMMIT:
        {
            /* Pending Commit means we're in the Self Test phase. */
            eImageState = eOTA_PAL_ImageState_PendingCommit;
            break;
        }
        case AWS_OTA_IMAGE_STATE_FLAG_IMG_VALID:
        {
            eImageState = eOTA_PAL_ImageState_Valid;
            break;
        }
        case AWS_OTA_IMAGE_STATE_FLAG_IMG_NEW:
        {
            eImageState = eOTA_PAL_ImageState_Valid;
            break;
        }
        default:
        {
            eImageState = eOTA_PAL_ImageState_Invalid;
            break;
        }
    }
    OTA_LOG_L1( "[%s] Image current state (0x%02x)\r\n", OTA_METHOD_NAME, eImageState );
    return eImageState;
}

u8 * prvReadAndAssumeCertificate_rtl8710b(const u8 * const pucCertName, s32 * const lSignerCertSize)
{
    OTA_PRINT( ("prvReadAndAssumeCertificate: not implemented yet\r\n") );
    return NULL;
}

